# TAKE HOME LAB EXERCISE

In [ ]:
import pandas as pd

-----------------------

**Q.no (1) . Write a code to load 'employees.csv' as `df`.**

In [50]:
import pandas as pd
df=pd.read_csv("employee.csv")
df=df.drop('Id',axis=1)
df.head(10)

,F_Name,S_Name,Sex,DOB,Department,Designation,Years_Exp,Location,salary
0,A,W,Male,10/01/59,Management,Managing Director,7,Bangalore,12000000
1,A,W,Male,04/08/70,Management,Director,9,Bangalore,12000000
2,A,W,Male,15/08/76,Management,Director,7,Bangalore,12000000
3,A,W,Male,04/03/68,Management,CEO,3,Bangalore,12000000
4,A,W,Female,05/04/60,Management,CTO,4,Bangalore,12000000
5,B,W,Female,15/10/55,Management,CFO,4,Bangalore,12000000
6,B,W,Male,19/07/79,R&D,Senior Engineer,6,Bangalore,5491873
7,B,W,Male,18/02/71,R&D,Senior Engineer,5,Bangalore,7748571
8,B,W,Male,03/02/67,R&D,Senior Engineer,2,Bangalore,6643336
9,B,W,Female,16/08/70,R&D,Senior Engineer,7,Bangalore,4619672

----------------

**Q.no(2).Write a code to `MERGE`(`outer`)  df1 & df2 as `data`.**

In [33]:
df1=pd.read_csv("Dataset4.csv")
df2=pd.read_csv("Dataset5.csv")
dfm=pd.merge(df1,df2,how="outer")
dfm

       emp   dept location   start
0     anil  admin      blr  2004.0
1     raju    eng      hyd  2008.0
2   mahesh    eng      blr     NaN
3   bikram     hr      del     NaN
4    sunil    NaN      blr  2012.0
5  sandeep    NaN      del  2104.0

----------------

**Q.no(3) . Write a code to `RENAME` the column from `salary` to `earnings`  of `employees dataset` and assign it to the new dataframe named as `data_01` .**

In [51]:
data_01=df.rename({"salary":"earnings"},axis=1)
data_01.head(10)

,F_Name,S_Name,Sex,DOB,Department,Designation,Years_Exp,Location,earnings
0,A,W,Male,10/01/59,Management,Managing Director,7,Bangalore,12000000
1,A,W,Male,04/08/70,Management,Director,9,Bangalore,12000000
2,A,W,Male,15/08/76,Management,Director,7,Bangalore,12000000
3,A,W,Male,04/03/68,Management,CEO,3,Bangalore,12000000
4,A,W,Female,05/04/60,Management,CTO,4,Bangalore,12000000
5,B,W,Female,15/10/55,Management,CFO,4,Bangalore,12000000
6,B,W,Male,19/07/79,R&D,Senior Engineer,6,Bangalore,5491873
7,B,W,Male,18/02/71,R&D,Senior Engineer,5,Bangalore,7748571
8,B,W,Male,03/02/67,R&D,Senior Engineer,2,Bangalore,6643336
9,B,W,Female,16/08/70,R&D,Senior Engineer,7,Bangalore,4619672

-----------------

**Q.no(4) . Write a code to `drop` the column 'DOB' of `employees dataset` and assign it to the new dataframe named as `data_02`.**

In [52]:
data_02=df.drop("DOB",axis=1)
data_02.head(10)

,F_Name,S_Name,Sex,Department,Designation,Years_Exp,Location,salary
0,A,W,Male,Management,Managing Director,7,Bangalore,12000000
1,A,W,Male,Management,Director,9,Bangalore,12000000
2,A,W,Male,Management,Director,7,Bangalore,12000000
3,A,W,Male,Management,CEO,3,Bangalore,12000000
4,A,W,Female,Management,CTO,4,Bangalore,12000000
5,B,W,Female,Management,CFO,4,Bangalore,12000000
6,B,W,Male,R&D,Senior Engineer,6,Bangalore,5491873
7,B,W,Male,R&D,Senior Engineer,5,Bangalore,7748571
8,B,W,Male,R&D,Senior Engineer,2,Bangalore,6643336
9,B,W,Female,R&D,Senior Engineer,7,Bangalore,4619672

-----------------

**Q.no(5) . Write a code to `drop` the `column no. 3 ` of `data_02` as per there `index position` .**

In [53]:
data_x=data_02.drop(data_02.columns[2],axis=1)
data_x.head(10)

  F_Name S_Name  Department        Designation  Years_Exp   Location    salary
0      A      W  Management  Managing Director          7  Bangalore  12000000
1      A      W  Management           Director          9  Bangalore  12000000
2      A      W  Management           Director          7  Bangalore  12000000
3      A      W  Management                CEO          3  Bangalore  12000000
4      A      W  Management                CTO          4  Bangalore  12000000
5      B      W  Management                CFO          4  Bangalore  12000000
6      B      W         R&D    Senior Engineer          6  Bangalore   5491873
7      B      W         R&D    Senior Engineer          5  Bangalore   7748571
8      B      W         R&D    Senior Engineer          2  Bangalore   6643336
9      B      W         R&D    Senior Engineer          7  Bangalore   4619672

-----------------

**Q.no(6). Write a code to replace all the `1` in the `year of experience` to `2` of `data_02`and assign it to the new dataframe named as `data_03`.**

In [37]:
data_03=data_02["Years_Exp"].replace(1,2)
data_03.head(10)

0    7
1    9
2    7
3    3
4    4
5    4
6    6
7    5
8    2
9    7
Name: Years_Exp, dtype: int64

-----------------

**Q.no(7). Write a code to identify duplicates in `Designation` column and show a `count` of it from `data_02`.**

In [39]:
data_dp=data_02[data_02.duplicated("Designation")]
data_dp["Designation"].count()

36

--------------

**Q.no(8). Write a code to show `average` `salary` of all the employees.**

In [40]:
data_02["salary"].mean()

6361413.64

---------------

**Q.no(9). Write a code to show mostly `designated position` for all the employees from employees dataset.**

In [55]:
data_02["Designation"].value_counts().head()

Senior Engineer                 7
Junior Engineer                 6
Manager                         5
Financial Accountant            5
Business Development Manager    5
Name: Designation, dtype: int64

----------------

**Q.no(10). Write a code to show the `average salary` for all `individual` `'designations'`.**

In [47]:
data_02.groupby(["Designation"])["salary"].mean()

Designation
Business Development Manager    6.478631e+06
CEO                             1.200000e+07
CFO                             1.200000e+07
CTO                             1.200000e+07
Director                        1.200000e+07
Financial Accountant            5.075276e+06
Junior Engineer                 4.387178e+06
Manager                         5.433516e+06
Managing Director               1.200000e+07
Marketing Manager               5.655196e+06
Marketing Research Analyst      4.195794e+06
Sales Consultant                5.950907e+06
Sales Executive                 6.103663e+06
Senior Engineer                 6.741181e+06
Name: salary, dtype: float64

-----------------

**Q.no(11). Write a code to show how much do the `salary` is `skewed` in `employees dataset`.**

In [48]:
data_02["salary"].skew()

0.44302256672395685

-------------------------

**Q.no(12). Write a code to show how much is the `kurtosis` in `salary` column for employees dataset.**

In [49]:
data_02["salary"].kurtosis()

-0.5480818630814084

# --------------------------------------- HAPPY LEARNING --------------------------------------------

--------------------